{
    "anime_facts_api": {
        "media": [
            {"anime_name": "bleach", "anime_img": "https://m.media-amazon.com/images/M/MV5BZjE0YjVjODQtZGY2NS00MDcyLThhMDAtZGQwMTZiOWNmNjRiXkEyXkFqcGdeQXVyNTA4NzY1MzY@._V1_FMjpg_UX1000_.jpg"},
            {"anime_name": "black_clover", "anime_img": "https://m.media-amazon.com/images/M/MV5BNTAzYTlkMWEtOTNjZC00ZDU0LWI5ODUtYTRmYzY0MTAzYWZlXkEyXkFqcGdeQXVyMzgxODM4NjM@._V1_FMjpg_UX1000_.jpg"},
            {"anime_name": "dragon_ball", "anime_img": "https://m.media-amazon.com/images/M/MV5BMGMyOThiMGUtYmFmZi00YWM0LWJiM2QtZGMwM2Q2ODE4MzhhXkEyXkFqcGdeQXVyMjc2Nzg5OTQ@._V1_FMjpg_UX1000_.jpg"},
            {"anime_name": "jujutsu_kaisen", "anime_img": "https://m.media-amazon.com/images/M/MV5BNzQyYzU3Y2MtOWY2Yy00ZGM2LTg3ZTUtMDJkZTJiMmEzMjYxXkEyXkFqcGdeQXVyMTI2NTY3NDg5._V1_.jpg"},
            {"anime_name": "fma_brotherhood", "anime_img": "https://m.media-amazon.com/images/M/MV5BZmEzN2YzOTItMDI5MS00MGU4LWI1NWQtOTg5ZThhNGQwYTEzXkEyXkFqcGdeQXVyNTA4NzY1MzY@._V1_.jpg"},
            {"anime_name": "naruto", "anime_img": "https://m.media-amazon.com/images/M/MV5BZmQ5NGFiNWEtMmMyMC00MDdiLTg4YjktOGY5Yzc2MDUxMTE1XkEyXkFqcGdeQXVyNTA4NzY1MzY@._V1_.jpg"},
            {"anime_name": "gintama", "anime_img": "https://m.media-amazon.com/images/M/MV5BMDkxZTJjZTEtMDRjMy00Yzk1LWI5YjItMjIwYmVlYzhlZWZhXkEyXkFqcGdeQXVyNDQxNjcxNQ@@._V1_FMjpg_UX1000_.jpg"},
            {"anime_name": "itachi_uchiha", "anime_img": "https://comicvine.gamespot.com/a/uploads/scale_small/0/378/859934-god2vj0xj3.jpg"},
            {"anime_name": "one_piece", "anime_img": "https://m.media-amazon.com/images/M/MV5BODcwNWE3OTMtMDc3MS00NDFjLWE1OTAtNDU3NjgxODMxY2UyXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_.jpg"},
            {"anime_name": "demon_slayer", "anime_img": "https://m.media-amazon.com/images/M/MV5BZjZjNzI5MDctY2Y4YS00NmM4LTljMmItZTFkOTExNGI3ODRhXkEyXkFqcGdeQXVyNjc3MjQzNTI@._V1_.jpg"},
            {"anime_name": "attack_on_titan", "anime_img": "https://flxt.tmsimg.com/assets/p10701949_b_v8_ah.jpg"},
            {"anime_name": "hunter_x_hunter", "anime_img": "https://m.media-amazon.com/images/M/MV5BZjNmZDhkN2QtNDYyZC00YzJmLTg0ODUtN2FjNjhhMzE3ZmUxXkEyXkFqcGdeQXVyNjc2NjA5MTU@._V1_FMjpg_UX1000_.jpg"},
            {"anime_name": "boku_no_hero_academia", "anime_img": "https://i.pinimg.com/736x/0f/7f/ee/0f7feeb4655ffc029d1b9823bafb2ff8.jpg"}
        ], 
        "animes": [
            {
                "name": "itachi_uchiha",
                "facts": [
                  "Itachi was Masashi Kishimoto’s Favourite Member Of Akatsuki",
                  "Itachi’s Original Concept Was Given to Danzo",
                  "Itachi is Proficient At One-Handed Seals",
                  "Itachi Was The 2nd Best Student Of All Time At The Academy",
                  "Kisame Wasn’t His First Partner In The Akatsuki",
                  "Itachi is responsible For Naruto Taking A Life",
                  "Itachi’s name actually means a weasel",
                  "Itachi in total has completed 340 official ninja missions in general. These include 53 D ranks, 152 C ranks, 134 B ranks, 0 A ranks and 1 S rank"
                ]
              },
              {
                "name": "gintama",
                "facts": [
                  "The original title of the series was Yorozuya Gin-chan",
                  "Sakata Gintoki had a completely different last name and character design in original drafts",
                  "For Sakata Gintoki’s creation Hideaki Sorachi also used a popular Japanese folk tale",
                  "Sakata Gintoki wore scooter goggles all the time",
                  "Shimura Shinpachi was planned to be part of the Shinsengumi",
                  "Shimura Shinpachi’s name contains 'Hachi' which means 8",
                  "Kagura knows Chinese",
                  "Kagura is the first Shonen Jump heroine to vomit",
                  "Sadaharu’s voice actor voices another Gintama character",
                  "Hideaki Sorachi wanted to do the series based on the Shinsengumi",
                  "Kondo Isao has a weak anal sphincter",
                  "Hijikata Toushirou’s voice actor voices a couple of swordsmen",
                  "Okita Sougo is based on a captain of the first unit of the Shinsengumi",
                  "Gintoki has the same birthday with the famous Naruto Uzumaki of Naruto"
                ]
              },
              {
                "name": "naruto",
                "facts": [
                  "Zabuza’s name means never cut twice",
                  "Sakura was supposed to die in episode 26",
                  "Chouji’s dad was part of the group that wanted to kill Naruto in Chapter 1",
                  "Naruto’s favorite ramen shop Ichiraku exists in real life",
                  "Shikamaru’s IQ is above 200",
                  "Kakuzu’s techniques are named after the series Mobile Suit Gundam",
                  "Neji’s forehead marks are different in the anime and manga",
                  "The tallest shinobi in Hidden Leaf is Ibiki Morino",
                  "Sanji from One Piece was supposed to be named Naruto",
                  "Canonically, Naruto’s Rasenshuriken is a reddish-orange color",
                  "Naruto and Kurama’s Bijuu Bomb is not the same color as the other bijuus",
                  "Sarutobi was supposed to be a monkey, but the creator of Naruto changed his mind and made him human like other Shinobis. Maybe that is why Lord Third was able to summon Enma"
                ]
              },
              {
                "name": "fma_brotherhood",
                "facts": [
                  "Ishvalans And Ametris Conflict Is Based On Hokkaido’s Ainu People",
                  "Arakawa Actually Bought Military Prop Guns For Drawing References",
                  "Arakawa Interviewed WWII Japanese Veterans For The Ishval War Arc",
                  "Law Of Equivalent Exchange Is Not Strictly Based On Eastern Or Western Alchemy",
                  "The Military Officers Are Named After Military Vehicles",
                  "Arakawa’s First Name Is Hiromi",
                  "Truth Is A Mirrored Version Of Whoever Enters The Gate",
                  "There Is Only One Known Photo Of Hiromu Arakawa"
                ]
              },
              {
                "name": "jujutsu_kaisen",
                "facts": [
                  "Gojo can cast domain expansion multiple times a day, while others are limited to only once a day",
                  "According to the author of Jujutsu Kaisen, Ryomen Sukuna never had a wife or children",
                  "So far there are only 4 Shamans or Jujutsu users who are on a special level. That is Gojo Satoru, Geto Suguru, Yuta Okkotsu and Tsukumo Yuki",
                  "Gege Sensei had planned to kill Yuji after Sukuna ripped out his heart in the manga if Shonen Jump didn’t go smoothly",
                  "The Zenin family home is derived from an architectural museum in Tokyo called Kodakarayu",
                  "At a young age, Toji would get thrown into a group of cursed spirits, the scar on his lip is a result of that",
                  "The eye within Gojo’s domain expansion is that of a black hole, or at the least, resembles a black hole",
                  "Ever since Gojo was born, cursed spirits and cursed users hid in the shadows due to Gojo possessing both the six eyes and the limitless cursed technique",
                  "Mahito likes Perry the Platypus from the animated series Phineas and Ferb that’s why he made Junpei like that",
                  "Gojo’s six eyes, also known as Rikugan, reduces Gojo’s cursed energy consumption allowing him to never run out of cursed energy"
                ]
              },
              {
                "name": "black_clover",
                "facts": [
                  "Asta can sense Ki",
                  "Yuno Is The Youngest Manazone Master",
                  "Asta's Original Name Is Staria",
                  "Yuno is the Reincarnation of Light's child",
                  "Asta Was Trained By an Enemy Soldier",
                  "Black Clover Manga Is Considered To Be Better Than The Anime",
                  "Captain Yami Sukehiro is a foreigner in the Clover Kingdom",
                  "Every member of Black Bulls was selected on purpose",
                  "Black Bulls is the smallest guild",
                  "Black Bulls hideout is a mobile castle and the castle is constantly changing"
                ]
              },
              {
                "name": "bleach",
                "facts": [
                  "Ichigo wasn't the first character that Kubo created. It was Rukia. Kubo felt like drawing a shinigami wearing a kimono, thus, Rukia was created.",
                  "Ichigo's English Voice Actor Was A Power Ranger",
                  "When Shonen Jump initially turned down Bleach, Kubo grew discouraged. The creator of DBZ, Akira Toriyama, sent a letter of encouragement and Bleach was later accepted.",
                  "Out of the 366 episodes in Bleach, 165 episodes (45%) are filler.",
                  "Tite Kubo Incorporated His Love Of Fashion Into Bleach",
                  "Ichigo Only Truly Killed One Major Enemy: the Fullbringer Ginjo",
                  "Ichigo claims his name come from 'Ichi' meaning first prize and 'Go' meaning guardian angel. However, his dad told him, his name means 'He who protects'.",
                  "The word Bleach is said to refer to the color 'white,' evincing monochrome vibes in contrast with the Shinigami's black garments. This is the direct, and most believable, explanation for the origin of the name, but there remains another possibility.",
                  "Originally, Kisuke Urahara was meant to be the villain of Bleach with Aizen being killed off when he was faking his death.",
                  "Orihime has said 'Kurosaki-kun' roughly over 800 times in the whole anime. She's said 'kun' over 1000 times.",
                  "Yoruichi's character original name was going to be Kuroneko, which means 'Black cat'. However, Kubo didn't want to take any risks of sparking racial comments, so he changed the name.",
                  "In Bleach, a shinigami's life force is equal to their spirit energy, it's the reason they live so long and can survive fatal wounds."
                ]
              },
              {
                "name": "dragon_ball",
                "facts": [
                  "Dragon Ball drew most of its influences from the classic Chinese story, Journey to the West.",
                  "In Dragon Ball Z, not counting movies or specials, Goku only killed two villains, Yakon and Kid Buu.",
                  "Goku Has Only Died Twice",
                  "Vegeta was originally intended to be a disposable villain who would be killed off fairly quickly after being defeated.",
                  "Sonic the Hedgehog Was Heavily Inspired by Dragon Ball Z",
                  "DB Voice Actors Have Fainted from Exertion",
                  "Goku and Frieza's First Fight Was the Longest in Anime History",
                  "There are no Female Super Saiyans in DBZ",
                  "Piccolo is actually only four years older than Gohan.",
                  "The Saiyans and the Tuffles waged a 10 year war for Planet Plant known as the Saiyan-Tuffle war.",
                  "Vegeta would technically be the 'King' of all Saiyans instead of the 'Prince' because his father was killed by Frieza, thus making him the rightful heir to the throne. However, he most likely does not call himself King out of respect for his fallen father.",
                  "Broly, the Legendary Super Saiyan was born with a power level of 10,000. This is comparable to most Saiyan elite warriors!",
                  "Goku is terribly afraid of needles.",
                  "The popular internet meme 'It's Over 9000!' was actually a dubbing mistake. It was originally over 8,000 but in the Ocean Dub, they accidentally say 9000.",
                  "After he fuses with Kami, Piccolo temporarily becomes the most powerful Z Fighter in the series. He surpasses the Super Saiyan powers of Goku, Vegeta, and Future Trunks.",
                  "Bulma goes through 17 hair style changes throughout the Dragon Ball series.",
                  "Cell is the only main villain that Goku never bites during battle.",
                  "There are over twenty five variants of the Kamehameha.",
                  "Majin Buu is over 5 million years old.",
                  "Goku never actually came face to face with Dr. Gero in Dragon Ball. In fact, he was never mentioned until in Dragon Ball Z.",
                  "Future Gohan was the only Saiyan character to ever battle with one arm.",
                  "King Kai's pet monkey, Bubbles, is a reference to Michael Jackson's pet monkey, who is also named Bubbles.",
                  "In the Funimation dub of Dragon Ball, Tambourine, a spawned warrior of the King Piccolo arc, sounds almost exactly like the Dragon Ball Z super villain Cell in his 'Imperfect' form as they both have the same voice actor.",
                  "Counting movie specials and Dragon Ball GT, the Spirit Bomb has been used exactly eight times in all of the Dragon Ball series.",
                  "Gohan, the son of Goku, was officially born on May 11th, 757 Age (A.D.).",
                  "Goku's home address is actually given, it is 439 East District.",
                  "Kid Buu would technically have the highest body count in the entire Dragon Ball series, as he killed millions if not billions of beings before his introduction in the latter half of Dragon Ball Z.",
                  "Vegeta says the name 'Goku' only eight times.",
                  "Bulma's last name is 'Brief'.",
                  "Nappa originally did have hair, as seen in the special, Dragon Ball Z: Bardock - The Father of Goku.",
                  "Master Roshi is 354 years old at the end of Dragon Ball Z.",
                  "Future Trunks is one of the few primary Z Fighters to have never used the Kamehameha wave, a trait he shares with his father.",
                  "Old Kai is approximately 15 Million years old during the events of the Majin Buu Saga.",
                  "There are three types of Android. They are: Cyborg, Total artificial construct types, and Bio-mechanical.",
                  "Pui Pui is named Pocus in the manga, another reference to 'Cinderella'.",
                  "Kai and Kaioshin are born as Shin-jin.",
                  "Piccolo is one of the only two characters in the Dragon Ball universe to have killed the main character Goku (the other being Cell). Although in both cases, Goku sacrificed himself to save the world.",
                  "Akira Toriyama stated his favorite character to be Piccolo.",
                  "Zarbon is responsible for advising Frieza to eradicate the Saiyan race, thus causing the ensuing genocide and setting the plot in motion for future wars and conflicts.",
                  "Ginyu Force mercenary squadron member Guldo's official alien race is Bas-jin.",
                  "Dragon Ball Z and One Piece had a cross-over known as 'Cross Epoch', which was created by both Akira Toriyama and Eiichiro Oda.",
                  "Goku and company appeared in a special known as Goku's Fire Fighting Regiment, which taught fire safety to kids in Japan.",
                  "Vegeta was born in 732 Age.",
                  "Akira Toriyama created the concept art for the Super Saiyan 4 transformation seen in Dragon Ball GT.",
                  "Future Gohan is killed instantly in the manga, while in the anime his fight and death is shown in great detail.",
                  "Yamcha is either severely injured, killed, or already dead in every saga of Dragon Ball Z.",
                  "Saiyan's hair styles never change from the day they are born.",
                  "Goku's death in the Cell Games Saga was an attempt to shift the focus of the series onto Gohan.",
                  "In the Original Manga that Chi-Chi originally has blue hair and that Bulma had purple hair.",
                  "Android 17 and Android 18 were originally human before Dr. Gero turned them into Androids."
                ]
              },
              {
                "name": "one_piece",
                "facts": [
                  "Even though Luffy is the main character of One Piece, Nami appears on screen before Luffy in the anime making her first main character to be seen.",
                  "The only way Luffy will part from his crew is either if he becomes the Pirate King or if he dies.",
                  "Zoro was the first crew member recruited by Luffy. However, in early drafts Zoro was drawn as part of the Buggys crew.",
                  "One of Zoro's hobbies is flipping through picture guides of weapons and bounty heads.",
                  "One Piece was supposed to run for a maximum of 5 years but Oda continued the series on because he really enjoys writing it.",
                  "Eiichiro Oda spends 3 days a week writing One Piece's story. He then spends another 3 days drawing it. He barely gets time off which is kinda funny since he pursued a career in manga as he said 'You don't have to get a real job'.",
                  "Sanji was originally supposed to be named Naruto but Oda changed it since there was a Naruto series coming out at the same time.",
                  "Dadan was originally a man. Dadan's early design showed him wearing a hat, shades and smoking a pipe.",
                  "The Strawhat crew is the only pirate crew known to have all its members with bounties on their heads.",
                  "Speed Jiru is the fastest man in the Whitebeard Pirates.",
                  "\"Ax Hand\" Morgan and \"Iron Mace\" Alvida are also names after famous pirates. Morgan is named after Henry Morgan.",
                  "Sabo is based off of Oliver Twist, from the top hat to the slightly dirty look.",
                  "Of the original Shichibukai, the 48 year old Gecko Moria is the tallest and oldest. Whereas Boa Hancock is only 29 years old.",
                  "Monkey D. Luffy is the first and only pirate in existence to ever enter and escape the top 3 government facilities.",
                  "If you pay attention to a creature called Pandaman, it can be seen frequently in the manga and anime.",
                  "Shanks got his 3 scars from battles with Blackbeard when he was still under Whitebeard.",
                  "Luffy's favorite pastime is eating watermelons at night in the summer.",
                  "Nico Robin always carries around Chopper's favorite candies.",
                  "Monet's design was based on Harpies from Greek Mythology since they were known to abduct people.",
                  "Monet is the first female character to die in the series.",
                  "Oda says that the hardest character to draw is Boa Hancock.",
                  "Boa Hancock is the only known female character to possess the Conqueror's Haki.",
                  "None of the males in the Strawhats knew how to tie a tie until they met Sanji.",
                  "At age 19 Luffy is the youngest member of all 12 members of the Worst Generation.",
                  "It's said that during Zoro's fight with Mr. 1, it's the first instance of Zoro using observation haki.",
                  "The world of One Piece is almost entirely made up of pirates in search of glory and the equally vicious Marines who claim to be able to keep them in check.",
                  "Long before Roger claimed One Piece for himself, at least some of the One Piece belonged to a man named Joy Boy during what is known as the Void Century.",
                  "The world government was ready to pay 5 billion berries for Ope Ope no mi."
                ]
              },
              {
                "name": "demon_slayer",
                "facts": [
                  "Kagaya and Muzan are from same family",
                  "Some demon slayers have some sort of mark on their bodies",
                  "The cost of the mark is pretty high, which is death of the demon slayer when he/she turns 25 due to the strain on the body",
                  "The mark grants power to the slayer like strength, speed and (crimson red nichirin blade in some cases)",
                  "Yoriichi Tsugikuni had the first mark",
                  "Each of the Corps has their own various breathing styles",
                  "Each Hashira has their own region to protect",
                  "The qualifications for becoming a Hashira are pretty high",
                  "The Demon Slayer Corps has a strict hierarchy",
                  "It takes a long time to become a Hashira"
                ]
              },
              {
                "name": "attack_on_titan",
                "facts": [
                  "Hajime Isyama s favorite character is Jean Kirschtein. Cause Isayma admires how Jean says what he wants without worrying about what other people think. But it was all in the past.",
                  "Originally, Eren was going to know that he is a titan all along. But thankfully, Isayama scrapped the idea.",
                  "Levi came on top in the 1st character popularity poll, Eren took the second place, While our favorite girl, Mikasa took the 3rd place.",
                  "Isayama has said that Mikasa will choose not to wear her precious scarf if it s too hot outside.",
                  "Isayama has revealed that Eren s titan form is based on Yushin Okami, a mixed Japanese martial artist. Isayama felt that he had the ideal physique of a middleweight mixed martial artist.",
                  "Moblit is Hange s second in command as well as her assistant. But thats not all. He is also the heaviest drinker in the survey corps. Isayama has said that this is due to his unfortunate position.",
                  "Marnia Inoue, the voice actor of Armin, is also the voice of the show s narrator.",
                  "Mikasa translates to 3 bamboo hats.",
                  "Isayama has said he received a strange phone call from his following the success of his series. They were curious about the sudden increase of funds in his savings. He postulated they probably thought I was running some bank transfer scam.",
                  "Armin s Birthday is on November 3rd, and It suits him. Cause in Japan, The day is celebrated as culture day, promoting academics, culture, and the fine arts.",
                  "Isayama made the theme of AOT cause he thought, Giants are kind of Gross.",
                  "In the Simpsons episode Treehouse of Horror xxv, Lisa was shown dressed as Mikasa. She even used 3D Maneuver Gear.",
                  "Mike is the tallest human character in the series at a looming 6.5.",
                  "It is most likely possible that Erwin Rommel, known as Desert Fox, was served as the main source of inspiration for Erwin Smith.",
                  "Aspects of Levi s design and personality are were based on Rorshach from Watchmen.",
                  "On average, Levi only sleeps around 2 to 3 hours a day.",
                  "Some titans are modeled after friends and acquaintances of Isayama. Sometimes he even takes requests.",
                  "Eren has the highest kill rate of any of the 104 Trainee squad.",
                  "Eren s voice actor Yuki Kaji cried while reading the script of the final season.",
                  "According to Isayama, Erwin stays single because he doesn t know when he ll die. Lucky for the Nile because they were in love with the same woman.",
                  "Isayama revealed that Levi sometimes wishes that he was a bit taller.",
                  "Attack On Titan has 7 episodes rated 9.9 or above. While Breaking Bad and Game Of Thrones have 7 combined.",
                  "Mikasa was the first character Isayama came up with when he was initially developing Attack On Titan.",
                  "Based on statistics from Attack On Titan guide book, Hange and Zeke are the two smartest characters in the series.",
                  "Levi is a Tea enthusiast. He enjoys collecting Tea leaves and is fond of black tea. Isayama has even said that Levi once wanted to open a tea shop."
                ]
              },
              {
                "name": "hunter_x_hunter",
                "facts": [
                  "The words on Zeno Zoldyk s clothing say either A Kill A Day or Never Retire.",
                  "The Phantom Troupe has an arm wrestling rank among themselves to determine their physical strength. The order from strongest to weakest of this arm wrestling is Uvogin, Phinks, Hisoka, Franklin, Feitan, Machi, Chrollo, Bonolenov, Nobunaga, Shalnark, Pakunoda, Shizuku, and Kortopi.",
                  "All four main protagonists share the same birthday characteristics – having the same number of birth month and day. And coincidentally, Hisoka too shares the same birthday characteristic. This is the reason why some fans consider him as the fifth protagonist.",
                  "A character from Yu Yu Hakusho, Suzaku appeared in Chrollo s book as one of his victims.",
                  "60 out of the 100 Richest characters in the series are Hunters.",
                  "The very first character to have appeared in Hunter x Hunter Manga is Kite.",
                  "Knuckle, Shoot, Palm, and Gyro are named after different baseball pitches Knuckleball, Shoot Ball, Palm ball, and Gyroball.",
                  "Sui Ishida, the creator of Tokyo Ghoul, is a big fan of Hunter X Hunter. Especially Hisoka.",
                  "In 1999 Hunter x Hunter anime, Killua watched porno during his stay in a Yorknew City hotel. He even asked Gon to join him. Thankfully, Gon refused the offer.",
                  "Togashi is married to the author of Sailor Moon, Naoko Takeuchi. She even helped him in earlier chapters.",
                  "Kurapika is the only known character in the entire HxH series with two Nen types – Conjuration and Specialization.",
                  "Morel s technique Deep Turtle is a reference to the rock band of the same name.",
                  "With a 3,250 feet tall, 251 floors, Heavens Arena is the 4th tallest building in the Hunter x Hunter series.",
                  "Hunter x Hunter has its own alphabets which can be translated directly to Japanese then to English.",
                  "Dwun s room in greed island arc is a reference to a photo of the author s room. Togashi has similar seas of Trash scattered around him while playing the game Dragon Quest.",
                  "It is shown in the series that Pituo has the biggest En range extending up to 2.2 Kilometers.",
                  "Killua s favorite food is ChocoRobo-Kun chocolate balls and he hates red peppers. He also has a gambling addiction.",
                  "Our bald Ninja, Hanzo, is named after Hatori Hanzo, a famous Japanese ninja.",
                  "Gon shares the same birthday with Monkey D. Luffy, the main protagonist of One Piece.",
                  "Only Ging Freecss passed the 267th Hunter Examination and it was the same case with Killua but on 288th.",
                  "Despite his appearances, Kalluto is a boy and is the youngest member of Phantom Troupe.",
                  "The Greed Island arc is created out of Togashi s desire to draw a card battle manga like Yugioh.",
                  "Hina s hat imitates her emotions.",
                  "All Silver-haired members of the Zoldyck family (Zeno, Silva, and Killua) have transmutation type of Nen. On the other hand, the dark-haired members of their family use the Manipulation type.",
                  "Did you know? Bungee gum has properties of both rubber and gum."
                ]
              },
              {
                "name": "boku_no_hero_academia",
                "facts": [
                  "The My Hero one-shot does have quite a few differences from what would later become the main series, but the biggest difference was the fact that the one-shot centered around an adult, named Jack Midoriya.",
                  "Aside from Izuku, the only character from the original My Hero one-shot to make it into the main series with little to no changes was the hero Snipe.",
                  "Originally, Bakugo was supposed to be a genius who was extremely kind and gentle towards others; however, he would have been slightly socially awkward, in the sense that he would unintentionally say things that were very hurtful to others.",
                  "Aside from being the fourth most popular hero, Best Jeanist runs the fashion industry that is marketed towards young and adult men.",
                  "When asked about the possibility of a time-skip, Horikoshi explained that at some point he does intend to have a time-skip for the series, however he is not sure when.",
                  "Shiozaki was originally going to be a member of class 1-A, but at some point Horikoshi moved her over to class 1-B.",
                  "At one point Himiko Toga is seen wearing a gas mask that has a striking resemblance to a certain villain from The Dark Knight Rises.",
                  "Apparently Tamaki s anxiety problem is based on a real-life situation Horikoshi went through.",
                  "The character Bubble Girl was actually created by a fan, rather than by Horikoshi.",
                  "Tsuyu Asui & Toro Hagakure Were Originally Men.",
                  "Ochaco Uraraka Used To Be Mt. Lady.",
                  "When it comes to the character Horikoshi relates to the most, he claims it has to be Izuku because he cries easily and cowers. Horikoshi claims that the two are very similar in that regard.",
                  "It is still unknown whether Principal Nezu is a dog, a mouse, a bear, or a mixture of all three.",
                  "Momo Yaoyorozu Is The Smartest Student In Class 1-A.",
                  "At one point in the series, the students point out that All Might is wearing a silver age costume, which is a reference to what is known as the Silver Age of comics which took place from 1956 to 1977.",
                  "In chapter 34 of the manga, there's one panel where the reader can see The Flash from DC Comics sitting in the stands cheering Todoroki on!"
                ]
              }  
        ]
    }
}